"""
    +       加
    -       减
    *       乘
    /       除
    //      取整除
    %       取余
    **      指数
"""
print("1 + 1 = ",1+1)
print("2 - 1 = ",2-1)
print("3 * 3 = ",3*3)
print("4 / 2 = ",4/2)
print("11 // 2 = ",11//2)
print("9 % 2 = ",9%2)
print("2 ** 2 = ",2**2)

"""
    复合赋值运算符
    +=      c += a  等效于c = c + a
    -=      c -= a  等效于c = c - a
    *=      c *= a  等效于c = c * a
    /=      c /= a  等效于c = c / a
    %=      c %= a  等效于c = c % a
    **=      c **= a  等效于c = c ** a
    //=      c //= a  等效于c = c // a
"""
